#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = (known after apply)
      + tags     = {
          + "environment" = "dev"
        }
    }

  # random_id.id will be created
  + resource "random_id" "id" {
      + b64         = (known after apply)
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.aks.azurerm_kubernetes_cluster.main will be created
  + resource "azurerm_kubernetes_cluster" "main" {
      + dns_prefix            = "dev"
      + fqdn                  = (known after apply)
      + id                    = (known after apply)
      + kube_admin_config     = (known after apply)
      + kube_admin_config_raw = (sensitive value)
      + kube_config           = (known after apply)
      + kube_config_raw       = (sensitive value)
      + kubernetes_version    = "1.16.7"
      + location              = "eastus"
      + name                  = "dev-aks"
      + node_resource_group   = (known after apply)
      + private_fqdn          = (known after apply)
      + resource_group_name   = (known after apply)

      + addon_profile {
          + aci_connector_linux {
              + enabled     = (known after apply)
              + subnet_name = (known after apply)
            }

          + azure_policy {
              + enabled = (known after apply)
            }

          + http_application_routing {
              + enabled                            = (known after apply)
              + http_application_routing_zone_name = (known after apply)
            }

          + kube_dashboard {
              + enabled = (known after apply)
            }

          + oms_agent {
              + enabled                    = (known after apply)
              + log_analytics_workspace_id = (known after apply)
            }
        }

      + default_node_pool {
          + max_pods        = (known after apply)
          + name            = "default"
          + node_count      = 1
          + os_disk_size_gb = (known after apply)
          + type            = "VirtualMachineScaleSets"
          + vm_size         = "Standard_D2_v3"
        }

      + linux_profile {
          + admin_username = "rhdhv_admin"

          + ssh_key {
              + key_data = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQC82Oe+maLnzIhIJLT2OkTTSnQdpltGSXXg5wZmwQj//Hy39mSKJeUDyb1OWyzFrE2c/JCVvXVTyzEBK7I6Yx5AiX6PnzFqVSeTw02aHiWtkQKrF/6VDcxIds8f4R8tCA4vdx2kaGMrH9PG4mJa0vo+cStKgifnNgtZ1pcVuOzb0ExOhB0woLNGZpeY8xGfbuhLA81GDHhfI6azPQc9YNzTy4mmU5AGQGn8NvLs+0BTOMtjIFl5N/VXugl4D/H4pCSM2Fl1fWQF2YBnD4OtL2gm3V+JYPKLJwBoYrmcIlBDYevuD3OS1g0PIgd7/mGEi8Vtf9UTTDZ+qiRTXWdbu2dr rramdas@Rodneys-iMac.local"
            }
        }

      + network_profile {
          + dns_service_ip     = (known after apply)
          + docker_bridge_cidr = (known after apply)
          + load_balancer_sku  = (known after apply)
          + network_plugin     = (known after apply)
          + network_policy     = (known after apply)
          + pod_cidr           = (known after apply)
          + service_cidr       = (known after apply)

          + load_balancer_profile {
              + effective_outbound_ips    = (known after apply)
              + managed_outbound_ip_count = (known after apply)
              + outbound_ip_address_ids   = (known after apply)
              + outbound_ip_prefix_ids    = (known after apply)
            }
        }

      + role_based_access_control {
          + enabled = (known after apply)

          + azure_active_directory {
              + client_app_id     = (known after apply)
              + server_app_id     = (known after apply)
              + server_app_secret = (sensitive value)
              + tenant_id         = (known after apply)
            }
        }

      + service_principal {
          + client_id     = "554ef7fa-b12b-4a07-84f6-25f19d4f0782"
          + client_secret = (sensitive value)
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```

</details>

*Workflow: `Terraform GitHub Actions`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`, Workspace: `${GITHUB_REF##*/}`*
